zamer/src/InformationRegisters/ПланРабот/ПланРабот.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ПланРабот</name>
  <resources>
    <name>Выполнена</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <attributes>
    <name>ДатаРегистрации</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаЗавершения</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>Приоритет</name>
    <type>
      <types>EnumRef.Приоритет</types>
    </type>
  </attributes>
  <dimensions>
    <name>Проект</name>
    <type>
      <types>CatalogRef.Проекты</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Работа</name>
    <type>
      <types>DefinedType.НаименованиеЗадачи</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

zamer/src/InformationRegisters/ПланРабот/Forms/ФормаЗаписи/Module.bsl
&НаКлиенте
Процедура ВыполненаПриИзменении(Элемент)
	
	Если Запись.Выполнена Тогда
		Запись.ДатаЗавершения = ТекущаяДата();
	Иначе
		Запись.ДатаЗавершения = Неопределено;	
	КонецЕсли;
		
КонецПроцедуры

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)

	Если Не ЗначениеЗаполнено(Запись.ДатаРегистрации) Тогда
		Запись.ДатаРегистрации = ТекущаяДата();		
	КонецЕсли;
		
КонецПроцедуры
